In [717]:
person = {
    "first": "Mayur",
    "last": "Pai",
    "email": "mayur5pai@gmail.com"
}

In [718]:
people = {
    "first": ["Mayur"],
    "last": ["Pai"],
    "email": ["mayur5pai@gmail.com"]
}

In [719]:
people = {
    "first": ["Mayur", 'Reshma'],
    "last": ["Pai", 'Pai'],
    "email": ["mayur5pai@gmail.com", 'reshmapai@email.com']
}

In [720]:
people['email']

['mayur5pai@gmail.com', 'reshmapai@email.com']

In [721]:
import pandas as pd

df = pd.DataFrame(data=people)

In [722]:
df

    first last                email
0   Mayur  Pai  mayur5pai@gmail.com
1  Reshma  Pai  reshmapai@email.com

In [723]:
df.email

0    mayur5pai@gmail.com
1    reshmapai@email.com
Name: email, dtype: object

In [724]:
df[['first', 'email']]

    first                email
0   Mayur  mayur5pai@gmail.com
1  Reshma  reshmapai@email.com

In [725]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [726]:
df.columns.tolist()

['first', 'last', 'email']

In [727]:
df.iloc[[0, 1], [2]]

                 email
0  mayur5pai@gmail.com
1  reshmapai@email.com

In [728]:
df.loc[[0, 1], ['email']]

                 email
0  mayur5pai@gmail.com
1  reshmapai@email.com

In [729]:
df.set_index('email', inplace=True)

In [730]:
df

                      first last
email
mayur5pai@gmail.com   Mayur  Pai
reshmapai@email.com  Reshma  Pai

In [731]:
df.index

Index(['mayur5pai@gmail.com', 'reshmapai@email.com'], dtype='object', name='email')

In [732]:
df.loc['mayur5pai@gmail.com']

first    Mayur
last       Pai
Name: mayur5pai@gmail.com, dtype: object

In [733]:
df.iloc[-1]

first    Reshma
last        Pai
Name: reshmapai@email.com, dtype: object

In [734]:
df.reset_index(inplace=True)

In [735]:
df

                 email   first last
0  mayur5pai@gmail.com   Mayur  Pai
1  reshmapai@email.com  Reshma  Pai

In [736]:
df.loc[0]

email    mayur5pai@gmail.com
first                  Mayur
last                     Pai
Name: 0, dtype: object

In [737]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [738]:
df.columns = ['Email', 'First Name', 'Last Name']

In [739]:
df

                 Email First Name Last Name
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@email.com     Reshma       Pai

In [740]:
df.columns = [z.upper() for z in df.columns]
df

                 EMAIL FIRST NAME LAST NAME
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@email.com     Reshma       Pai

In [741]:
df.rename(columns={'EMAIL': 'Email'})

                 Email FIRST NAME LAST NAME
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@email.com     Reshma       Pai

In [742]:
df.loc[2] = ['abcd@gmail.com', 'ab', 'cd']

In [743]:
df

                 EMAIL FIRST NAME LAST NAME
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@email.com     Reshma       Pai
2       abcd@gmail.com         ab        cd

In [744]:
df.loc[1] = ['reshmapai007@yahoo.com', 'Reshma', 'Pai']

In [745]:
df

                    EMAIL FIRST NAME LAST NAME
0     mayur5pai@gmail.com      Mayur       Pai
1  reshmapai007@yahoo.com     Reshma       Pai
2          abcd@gmail.com         ab        cd

In [746]:
df.loc[1, 'email'] = 'reshmapai@gmail.com'

In [747]:
df

                    EMAIL FIRST NAME LAST NAME                email
0     mayur5pai@gmail.com      Mayur       Pai                  NaN
1  reshmapai007@yahoo.com     Reshma       Pai  reshmapai@gmail.com
2          abcd@gmail.com         ab        cd                  NaN

In [748]:
df.drop(columns=['email'], inplace=True)

In [749]:
df

                    EMAIL FIRST NAME LAST NAME
0     mayur5pai@gmail.com      Mayur       Pai
1  reshmapai007@yahoo.com     Reshma       Pai
2          abcd@gmail.com         ab        cd

In [750]:
df.loc[1, 'EMAIL'] = 'reshmapai@gmail.com'

In [751]:
df

                 EMAIL FIRST NAME LAST NAME
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@gmail.com     Reshma       Pai
2       abcd@gmail.com         ab        cd

In [752]:
df.loc[2, ['EMAIL', 'FIRST NAME']] = ['xyz@gmail.com', "XYZ"]

In [753]:
df

                 EMAIL FIRST NAME LAST NAME
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@gmail.com     Reshma       Pai
2        xyz@gmail.com        XYZ        cd

In [754]:
df.rename(columns={'EMAIL':'email'}, inplace=True)

In [755]:
df

                 email FIRST NAME LAST NAME
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@gmail.com     Reshma       Pai
2        xyz@gmail.com        XYZ        cd

In [756]:
df['email'].apply(lambda x: x.split('@')[0])

0    mayur5pai
1    reshmapai
2          xyz
Name: email, dtype: object

In [757]:
df['email'].apply(len)

0    19
1    19
2    13
Name: email, dtype: int64

In [758]:
def upper_case(email):
    return email.upper()

In [759]:
df['email'] = df['email'].apply(upper_case)

In [760]:
df

                 email FIRST NAME LAST NAME
0  MAYUR5PAI@GMAIL.COM      Mayur       Pai
1  RESHMAPAI@GMAIL.COM     Reshma       Pai
2        XYZ@GMAIL.COM        XYZ        cd

In [761]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [762]:
df

                 email FIRST NAME LAST NAME
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@gmail.com     Reshma       Pai
2        xyz@gmail.com        XYZ        cd

In [763]:
df.apply(len)

email         3
FIRST NAME    3
LAST NAME     3
dtype: int64

In [764]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [765]:
df.apply(lambda x: x.max())

email         xyz@gmail.com
FIRST NAME              XYZ
LAST NAME                cd
dtype: object

In [766]:
df.apply(pd.Series.min)

email         mayur5pai@gmail.com
FIRST NAME                  Mayur
LAST NAME                     Pai
dtype: object

In [767]:
df.apply(pd.Series.max)

email         xyz@gmail.com
FIRST NAME              XYZ
LAST NAME                cd
dtype: object

In [768]:
df.applymap(lambda x: x.lower())

                 email FIRST NAME LAST NAME
0  mayur5pai@gmail.com      mayur       pai
1  reshmapai@gmail.com     reshma       pai
2        xyz@gmail.com        xyz        cd

In [769]:
df.applymap(len)

   email  FIRST NAME  LAST NAME
0     19           5          3
1     19           6          3
2     13           3          2

In [770]:
df

                 email FIRST NAME LAST NAME
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@gmail.com     Reshma       Pai
2        xyz@gmail.com        XYZ        cd

In [771]:
df['email'].replace('email', 'emails', regex=True, inplace=True)

In [772]:
df

                 email FIRST NAME LAST NAME
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@gmail.com     Reshma       Pai
2        xyz@gmail.com        XYZ        cd

In [773]:
df['email'] = ["mayur5pai@gmail.com", 'reshmapai@email.com', 'xyz@gmail.com']

In [774]:
df

                 email FIRST NAME LAST NAME
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@email.com     Reshma       Pai
2        xyz@gmail.com        XYZ        cd

In [775]:
df.replace({'mayur5pai@gmail.com': '<EMAIL>'})

                 email FIRST NAME LAST NAME
0              <EMAIL>      Mayur       Pai
1  reshmapai@email.com     Reshma       Pai
2        xyz@gmail.com        XYZ        cd

In [776]:
df

                 email FIRST NAME LAST NAME
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@email.com     Reshma       Pai
2        xyz@gmail.com        XYZ        cd

In [777]:
df.drop(columns=['LAST NAME'])

                 email FIRST NAME
0  mayur5pai@gmail.com      Mayur
1  reshmapai@email.com     Reshma
2        xyz@gmail.com        XYZ

In [778]:
df

                 email FIRST NAME LAST NAME
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@email.com     Reshma       Pai
2        xyz@gmail.com        XYZ        cd

In [779]:
df.columns

Index(['email', 'FIRST NAME', 'LAST NAME'], dtype='object')

In [780]:
df.columns = ['Email', 'First Name', 'Last Name']

In [781]:
df.columns = [z.lower() for z in df.columns]

In [782]:
df

                 email first name last name
0  mayur5pai@gmail.com      Mayur       Pai
1  reshmapai@email.com     Reshma       Pai
2        xyz@gmail.com        XYZ        cd

In [783]:
df['full name'] = df['first name'] + ' ' + df['last name']

In [784]:
df

                 email first name last name   full name
0  mayur5pai@gmail.com      Mayur       Pai   Mayur Pai
1  reshmapai@email.com     Reshma       Pai  Reshma Pai
2        xyz@gmail.com        XYZ        cd      XYZ cd

In [785]:
df['new first name'] = df['full name'].str.split(' ', expand=True)[0]

In [786]:
df

                 email first name last name   full name new first name
0  mayur5pai@gmail.com      Mayur       Pai   Mayur Pai          Mayur
1  reshmapai@email.com     Reshma       Pai  Reshma Pai         Reshma
2        xyz@gmail.com        XYZ        cd      XYZ cd            XYZ

In [787]:
people = {
    'first': ['Tony', 'Steve', 'Mayur'],
    'last': ['Stark', 'Rogers', 'Pai'],
    'email': ['IronMan@avenge.com', 'Cap@avenge.com', 'mayur5pai@gmail.com']
}
df2 = pd.DataFrame(people)

In [788]:
df2

   first    last                email
0   Tony   Stark   IronMan@avenge.com
1  Steve  Rogers       Cap@avenge.com
2  Mayur     Pai  mayur5pai@gmail.com

In [789]:
merged_df = pd.concat([df, df2])

In [790]:
pd.merge(df, df2, on='email', how='inner')

,email,first name,last name,full name,new first name,first,last
0,mayur5pai@gmail.com,Mayur,Pai,Mayur Pai,Mayur,Mayur,Pai

In [791]:
pd.merge(df, df2, on='email', how='outer')

,email,first name,last name,full name,new first name,first,last
0,mayur5pai@gmail.com,Mayur,Pai,Mayur Pai,Mayur,Mayur,Pai
1,reshmapai@email.com,Reshma,Pai,Reshma Pai,Reshma,NaN,NaN
2,xyz@gmail.com,XYZ,cd,XYZ cd,XYZ,NaN,NaN
3,IronMan@avenge.com,NaN,NaN,NaN,NaN,Tony,Stark
4,Cap@avenge.com,NaN,NaN,NaN,NaN,Steve,Rogers

In [792]:
pd.merge(df, df2, on='email')

,email,first name,last name,full name,new first name,first,last
0,mayur5pai@gmail.com,Mayur,Pai,Mayur Pai,Mayur,Mayur,Pai

In [793]:
merged_df

,email,first name,last name,full name,new first name,first,last
0,mayur5pai@gmail.com,Mayur,Pai,Mayur Pai,Mayur,NaN,NaN
1,reshmapai@email.com,Reshma,Pai,Reshma Pai,Reshma,NaN,NaN
2,xyz@gmail.com,XYZ,cd,XYZ cd,XYZ,NaN,NaN
0,IronMan@avenge.com,NaN,NaN,NaN,NaN,Tony,Stark
1,Cap@avenge.com,NaN,NaN,NaN,NaN,Steve,Rogers
2,mayur5pai@gmail.com,NaN,NaN,NaN,NaN,Mayur,Pai

In [794]:
temp_mdf = merged_df

In [795]:
temp_mdf

,email,first name,last name,full name,new first name,first,last
0,mayur5pai@gmail.com,Mayur,Pai,Mayur Pai,Mayur,NaN,NaN
1,reshmapai@email.com,Reshma,Pai,Reshma Pai,Reshma,NaN,NaN
2,xyz@gmail.com,XYZ,cd,XYZ cd,XYZ,NaN,NaN
0,IronMan@avenge.com,NaN,NaN,NaN,NaN,Tony,Stark
1,Cap@avenge.com,NaN,NaN,NaN,NaN,Steve,Rogers
2,mayur5pai@gmail.com,NaN,NaN,NaN,NaN,Mayur,Pai

In [796]:
temp_mdf.drop(index=temp_mdf.index[0], inplace=True)

In [797]:
filter = temp_mdf['first name'] == 'XYZ'

In [798]:
filter

1    False
2     True
1    False
2    False
Name: first name, dtype: bool

In [799]:
temp_mdf

,email,first name,last name,full name,new first name,first,last
1,reshmapai@email.com,Reshma,Pai,Reshma Pai,Reshma,NaN,NaN
2,xyz@gmail.com,XYZ,cd,XYZ cd,XYZ,NaN,NaN
1,Cap@avenge.com,NaN,NaN,NaN,NaN,Steve,Rogers
2,mayur5pai@gmail.com,NaN,NaN,NaN,NaN,Mayur,Pai

In [800]:
temp_mdf.drop(index=temp_mdf[filter].index, inplace=True)

In [801]:
temp_mdf

,email,first name,last name,full name,new first name,first,last
1,reshmapai@email.com,Reshma,Pai,Reshma Pai,Reshma,NaN,NaN
1,Cap@avenge.com,NaN,NaN,NaN,NaN,Steve,Rogers

In [802]:
temp_mdf.dropna(axis=1, inplace=True)

In [803]:
temp_mdf

                 email
1  reshmapai@email.com
1       Cap@avenge.com

In [804]:
df

                 email first name last name   full name new first name
0  mayur5pai@gmail.com      Mayur       Pai   Mayur Pai          Mayur
1  reshmapai@email.com     Reshma       Pai  Reshma Pai         Reshma
2        xyz@gmail.com        XYZ        cd      XYZ cd            XYZ

In [807]:
df.drop(columns=['new first name'], inplace=True)

In [808]:
df

                 email first name last name   full name
0  mayur5pai@gmail.com      Mayur       Pai   Mayur Pai
1  reshmapai@email.com     Reshma       Pai  Reshma Pai
2        xyz@gmail.com        XYZ        cd      XYZ cd

In [814]:
df.sort_values(by=['email', 'first name'], ascending=False, inplace=True)

In [815]:
df

                 email first name last name   full name
2        xyz@gmail.com        XYZ        cd      XYZ cd
1  reshmapai@email.com     Reshma       Pai  Reshma Pai
0  mayur5pai@gmail.com      Mayur       Pai   Mayur Pai

In [816]:
df['age'] = [15, 19, 24]

In [817]:
df

                 email first name last name   full name  age
2        xyz@gmail.com        XYZ        cd      XYZ cd   15
1  reshmapai@email.com     Reshma       Pai  Reshma Pai   19
0  mayur5pai@gmail.com      Mayur       Pai   Mayur Pai   24

In [829]:
a = df['age'].nsmallest(2)

In [823]:
df.nlargest(2, 'age')

                 email first name last name   full name  age
0  mayur5pai@gmail.com      Mayur       Pai   Mayur Pai   24
1  reshmapai@email.com     Reshma       Pai  Reshma Pai   19

In [824]:
df.nsmallest(2, 'age')

                 email first name last name   full name  age
2        xyz@gmail.com        XYZ        cd      XYZ cd   15
1  reshmapai@email.com     Reshma       Pai  Reshma Pai   19

In [835]:
df.sort_index()

                 email first name last name   full name  age
0  mayur5pai@gmail.com      Mayur       Pai   Mayur Pai   24
1  reshmapai@email.com     Reshma       Pai  Reshma Pai   19
2        xyz@gmail.com        XYZ        cd      XYZ cd   15

In [838]:
df['last name'].sort_values(ascending=False)

2     cd
1    Pai
0    Pai
Name: last name, dtype: object

In [842]:
import numpy as np
people = {
    'first': ['A', 'B', 'C', 'D', np.nan, None, 'NA'],
    'last': ['E', 'F', 'G', 'H', np.nan, np.nan, 'Missing'],
    'email': ['z@gmail.com', 'y@email.com', 'x@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [843]:
df = pd.DataFrame(people)

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [844]:
df

  first last                email   age
0     A    E          z@gmail.com    33
1     B    F          y@email.com    55
2     C    G          x@email.com    63
3     D    H                 None    36
4   NaN  NaN                  NaN  None
5  None  NaN  Anonymous@email.com  None
6   NaN  NaN                  NaN   NaN

In [845]:
df.dropna()

  first last        email age
0     A    E  z@gmail.com  33
1     B    F  y@email.com  55
2     C    G  x@email.com  63

In [846]:
df

  first last                email   age
0     A    E          z@gmail.com    33
1     B    F          y@email.com    55
2     C    G          x@email.com    63
3     D    H                 None    36
4   NaN  NaN                  NaN  None
5  None  NaN  Anonymous@email.com  None
6   NaN  NaN                  NaN   NaN

In [847]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

  first last                email   age
0     A    E          z@gmail.com    33
1     B    F          y@email.com    55
2     C    G          x@email.com    63
3     D    H                 None    36
5  None  NaN  Anonymous@email.com  None

In [852]:
df.dropna(axis='index', how='any', subset=['last', 'email', 'age'])

  first last        email age
0     A    E  z@gmail.com  33
1     B    F  y@email.com  55
2     C    G  x@email.com  63

In [853]:
df.dropna(axis='index', how='all', subset=['last', 'email', 'age'])

  first last                email   age
0     A    E          z@gmail.com    33
1     B    F          y@email.com    55
2     C    G          x@email.com    63
3     D    H                 None    36
5  None  NaN  Anonymous@email.com  None

In [849]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [854]:
df.fillna(0)

  first last                email age
0     A    E          z@gmail.com  33
1     B    F          y@email.com  55
2     C    G          x@email.com  63
3     D    H                    0  36
4     0    0                    0   0
5     0    0  Anonymous@email.com   0
6     0    0                    0   0

In [855]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [859]:
df['age'].mean()

46.75

In [856]:
df['age'] = df['age'].astype(float)

In [857]:
df

  first last                email   age
0     A    E          z@gmail.com  33.0
1     B    F          y@email.com  55.0
2     C    G          x@email.com  63.0
3     D    H                 None  36.0
4   NaN  NaN                  NaN   NaN
5  None  NaN  Anonymous@email.com   NaN
6   NaN  NaN                  NaN   NaN

In [858]:
df['age'].mean()

46.75